# StructuralSectionCSlopedFlange Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
StructuralSectionCSlopedFlange Methods
StructuralSectionCSlopedFlange Class See Also
---
The StructuralSectionCSlopedFlange type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | (Inherited from StructuralSection.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetBoundarySize | Returns size of the section boundary.  (Inherited from StructuralSection.) |
| GetEnumerator | (Inherited from StructuralSection.) |
| GetFlangeThicknessInFlangeCenter | Returns thickness of flange measured in the 0.5 * (width - webThickess), sometimes used for sections with width > 300 mm.  (Inherited from StructuralSectionGeneralU.) |
| GetFlangeThicknessInWidthCenter | Returns thickness of flange measured in the 0.5 * width, sometimes used for sections with width <= 300 mm.  (Inherited from StructuralSectionGeneralU.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
StructuralSectionCSlopedFlange Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace